# 14)Напишите программу, которая принимает на вход вещественное
# число и показывает сумму его цифр.
#
# Пример:
#
# - 6782 -> 23
# - 0,56 -> 11

# number_str= input()
# summ=0
# for i in number_str:
#     if i != '.':
#         summ += int(i)
# print (summ)


# 15) Напишите программу, которая принимает на вход число N и выдает набор
# произведений чисел от 1 до N.
#
# Пример:
#
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# N= int(input('VVedite chislo N '))
# summ=1
# for i in range(1,N):
#     summ = summ*i
#     print(summ, end=', ')
# print(summ*N)


# 18) Реализуйте алгоритм перемешивания списка.

# import random
#
# list = ["Banana", "Kooper", "Cho"]
# random.shuffle(mylist)
#
# print(list)


# 16)Задайте список из n чисел последовательности (1 + 1 / n) ** n и
# выведите на экран их сумму.
#
# Пример:
#
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
#
# NE smog ponyat uslovie etoy zadachi
